{"selectedVerses":[{"reference":{"book":"Ezekiel","chapter":14,"verse":7},"text":"For any one of the house of Israel, or of the strangers who sojourn in Israel, who separates himself from me, taking his idols into his heart and putting the stumbling block of his iniquity before his face, and yet comes to a prophet to consult me through him, I the LORD will answer him myself."},{"reference":{"book":"Ezekiel","chapter":39,"verse":11},"text":"\u0022On that day I will give to Gog a place for burial in Israel, the Valley of the Travelers, east of the sea. It will block the travelers, for there Gog and all his multitude will be buried. It will be called the Valley of Hamon-gog."},{"reference":{"book":"Ezekiel","chapter":14,"verse":3},"text":"\u0022Son of man, these men have taken their idols into their hearts, and set the stumbling block of their iniquity before their faces. Should I indeed let myself be consulted by them?"},{"reference":{"book":"Ezekiel","chapter":7,"verse":19},"text":"They cast their silver into the streets, and their gold is like an unclean thing. Their silver and gold are not able to deliver them in the day of the wrath of the LORD. They cannot satisfy their hunger or fill their stomachs with it. For it was the stumbling block of their iniquity."},{"reference":{"book":"Romans","chapter":11,"verse":9},"text":"And David says, \u0022Let their table become a snare and a trap, a stumbling block and a retribution for them;"}],"allVerseReferences":[{"book":"Leviticus","chapter":19,"verse":14},{"book":"Isaiah","chapter":44,"verse":19},{"book":"Ezekiel","chapter":3,"verse":20},{"book":"Ezekiel","chapter":7,"verse":19},{"book":"Ezekiel","chapter":14,"verse":3},{"book":"Ezekiel","chapter":14,"verse":7},{"book":"Ezekiel","chapter":14,"verse":4},{"book":"Ezekiel","chapter":44,"verse":12},{"book":"Romans","chapter":11,"verse":9},{"book":"Romans","chapter":14,"verse":13},{"book":"1 Corinthians","chapter":8,"verse":9},{"book":"1 Corinthians","chapter":1,"verse":23},{"book":"Ezekiel","chapter":39,"verse":11},{"book":"Revelation","chapter":2,"verse":14}]}