{"selectedVerses":[{"reference":{"book":"Esther","chapter":8,"verse":8},"text":"But you may write as you please with regard to the Jews, in the name of the king, and seal it with the king\u0027s ring, for an edict written in the name of the king and sealed with the king\u0027s ring cannot be revoked.\u0022"},{"reference":{"book":"Esther","chapter":9,"verse":1},"text":"Now in the twelfth month, which is the month of Adar, on the thirteenth day of the same, when the king\u0027s command and edict were about to be carried out, on the very day when the enemies of the Jews hoped to gain the mastery over them, the reverse occurred: the Jews gained mastery over those who hated them."},{"reference":{"book":"Hebrews","chapter":11,"verse":23},"text":"By faith Moses, when he was born, was hidden for three months by his parents, because they saw that the child was beautiful, and they were not afraid of the king\u0027s edict."},{"reference":{"book":"Esther","chapter":3,"verse":12},"text":"Then the king\u0027s scribes were summoned on the thirteenth day of the first month, and an edict, according to all that Haman commanded, was written to the king\u0027s satraps and to the governors over all the provinces and to the officials of all the peoples, to every province in its own script and every people in its own language. It was written in the name of King Ahasuerus and sealed with the king\u0027s signet ring."},{"reference":{"book":"Esther","chapter":8,"verse":9},"text":"The king\u0027s scribes were summoned at that time, in the third month, which is the month of Sivan, on the twenty-third day. And an edict was written, according to all that Mordecai commanded concerning the Jews, to the satraps and the governors and the officials of the provinces from India to Ethiopia, 127 provinces, to each province in its own script and to each people in its own language, and also to the Jews in their script and their language."}],"allVerseReferences":[{"book":"Ezra","chapter":6,"verse":11},{"book":"Esther","chapter":1,"verse":8},{"book":"Esther","chapter":8,"verse":17},{"book":"Esther","chapter":9,"verse":1},{"book":"Esther","chapter":2,"verse":8},{"book":"Esther","chapter":9,"verse":13},{"book":"Esther","chapter":3,"verse":12},{"book":"Esther","chapter":8,"verse":8},{"book":"Esther","chapter":8,"verse":9},{"book":"Hebrews","chapter":11,"verse":23}]}