{"selectedVerses":[{"reference":{"book":"Nehemiah","chapter":13,"verse":21},"text":"But I warned them and said to them, \u0022Why do you lodge outside the wall? If you do so again, I will lay hands on you.\u0022 From that time on they did not come on the Sabbath."},{"reference":{"book":"Ruth","chapter":1,"verse":16},"text":"But Ruth said, \u0022Do not urge me to leave you or to return from following you. For where you go I will go, and where you lodge I will lodge. Your people shall be my people, and your God my God."},{"reference":{"book":"Zephaniah","chapter":2,"verse":14},"text":"Herds shall lie down in her midst, all kinds of beasts; even the owl and the hedgehog shall lodge in her capitals; a voice shall hoot in the window; devastation will be on the threshold; for her cedar work will be laid bare."},{"reference":{"book":"Judges","chapter":19,"verse":9},"text":"And when the man and his concubine and his servant rose up to depart, his father-in-law, the girl\u0027s father, said to him, \u0022Behold, now the day has waned toward evening. Please, spend the night. Behold, the day draws to its close. Lodge here and let your heart be merry, and tomorrow you shall arise early in the morning for your journey, and go home.\u0022"},{"reference":{"book":"Jeremiah","chapter":4,"verse":14},"text":"O Jerusalem, wash your heart from evil, that you may be saved. How long shall your wicked thoughts lodge within you?"}],"allVerseReferences":[{"book":"Numbers","chapter":22,"verse":8},{"book":"Joshua","chapter":4,"verse":3},{"book":"Judges","chapter":19,"verse":9},{"book":"Ruth","chapter":1,"verse":16},{"book":"Nehemiah","chapter":13,"verse":21},{"book":"Psalms","chapter":55,"verse":7},{"book":"Song of Solomon","chapter":7,"verse":11},{"book":"Isaiah","chapter":1,"verse":8},{"book":"Isaiah","chapter":10,"verse":29},{"book":"Isaiah","chapter":21,"verse":13},{"book":"Jeremiah","chapter":4,"verse":14},{"book":"Zephaniah","chapter":2,"verse":14},{"book":"Acts","chapter":21,"verse":16}]}