{"selectedVerses":[{"reference":{"book":"Revelation","chapter":2,"verse":17},"text":"He who has an ear, let him hear what the Spirit says to the churches. To the one who conquers I will give some of the hidden manna, and I will give him a white stone, with a new name written on the stone that no one knows except the one who receives it.\u0027"},{"reference":{"book":"Joshua","chapter":5,"verse":12},"text":"And the manna ceased the day after they ate of the produce of the land. And there was no longer manna for the people of Israel, but they ate of the fruit of the land of Canaan that year."},{"reference":{"book":"Deuteronomy","chapter":8,"verse":3},"text":"And he humbled you and let you hunger and fed you with manna, which you did not know, nor did your fathers know, that he might make you know that man does not live by bread alone, but man lives by every word that comes from the mouth of the LORD."},{"reference":{"book":"Hebrews","chapter":9,"verse":4},"text":"having the golden altar of incense and the ark of the covenant covered on all sides with gold, in which was a golden urn holding the manna, and Aaron\u0027s staff that budded, and the tablets of the covenant."},{"reference":{"book":"Exodus","chapter":16,"verse":31},"text":"Now the house of Israel called its name manna. It was like coriander seed, white, and the taste of it was like wafers made with honey."}],"allVerseReferences":[{"book":"Exodus","chapter":16,"verse":33},{"book":"Exodus","chapter":16,"verse":35},{"book":"Exodus","chapter":16,"verse":31},{"book":"Numbers","chapter":11,"verse":6},{"book":"Numbers","chapter":11,"verse":7},{"book":"Numbers","chapter":11,"verse":9},{"book":"Deuteronomy","chapter":8,"verse":16},{"book":"Deuteronomy","chapter":8,"verse":3},{"book":"Joshua","chapter":5,"verse":12},{"book":"Nehemiah","chapter":9,"verse":20},{"book":"Psalms","chapter":78,"verse":24},{"book":"John","chapter":6,"verse":49},{"book":"John","chapter":6,"verse":31},{"book":"Hebrews","chapter":9,"verse":4},{"book":"Revelation","chapter":2,"verse":17}]}