{"selectedVerses":[{"reference":{"book":"2 Chronicles","chapter":31,"verse":3},"text":"The contribution of the king from his own possessions was for the burnt offerings: the burnt offerings of morning and evening, and the burnt offerings for the Sabbaths, the new moons, and the appointed feasts, as it is written in the Law of the LORD."},{"reference":{"book":"2 Chronicles","chapter":2,"verse":4},"text":"Behold, I am about to build a house for the name of the LORD my God and dedicate it to him for the burning of incense of sweet spices before him, and for the regular arrangement of the showbread, and for burnt offerings morning and evening, on the Sabbaths and the new moons and the appointed feasts of the LORD our God, as ordained forever for Israel."},{"reference":{"book":"Isaiah","chapter":47,"verse":13},"text":"You are wearied with your many counsels; let them stand forth and save you, those who divide the heavens, who gaze at the stars, who at the new moons make known what shall come upon you."},{"reference":{"book":"2 Chronicles","chapter":8,"verse":13},"text":"as the duty of each day required, offering according to the commandment of Moses for the Sabbaths, the new moons, and the three annual feasts--the Feast of Unleavened Bread, the Feast of Weeks, and the Feast of Booths."},{"reference":{"book":"Nehemiah","chapter":10,"verse":33},"text":"for the showbread, the regular grain offering, the regular burnt offering, the Sabbaths, the new moons, the appointed feasts, the holy things, and the sin offerings to make atonement for Israel, and for all the work of the house of our God."}],"allVerseReferences":[{"book":"1 Chronicles","chapter":23,"verse":31},{"book":"2 Chronicles","chapter":2,"verse":4},{"book":"2 Chronicles","chapter":8,"verse":13},{"book":"2 Chronicles","chapter":31,"verse":3},{"book":"Nehemiah","chapter":10,"verse":33},{"book":"Isaiah","chapter":1,"verse":14},{"book":"Isaiah","chapter":47,"verse":13},{"book":"Ezekiel","chapter":45,"verse":17},{"book":"Ezekiel","chapter":46,"verse":3},{"book":"Hosea","chapter":2,"verse":11}]}